abstra_notas/nfse/ce/fortaleza/templates/EnvioLoteRPS.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope 
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope" 
    xmlns:ns="http://www.fortaleza.ce.gov.br/iss">
    <soap:Header/>
    <soap:Body>
        <ns:RecepcionarLoteRps>
            <ns:LoteRps>
                <ns:NumeroLote>{{ numero_lote }}</ns:NumeroLote>
                <ns:Cnpj>{{ remetente if remetente_tipo == '2' else '' }}</ns:Cnpj>
                {% if remetente_tipo == '1' %}
                <ns:Cpf>{{ remetente }}</ns:Cpf>
                {% endif %}
                <ns:InscricaoMunicipal></ns:InscricaoMunicipal>
                <ns:QuantidadeRps>{{ qtd_rps }}</ns:QuantidadeRps>
                <ns:ListaRps>
                    {% for rps in lista_rps %}
                    {{ rps | safe }}
                    {% endfor %}
                </ns:ListaRps>
            </ns:LoteRps>
        </ns:RecepcionarLoteRps>
    </soap:Body>
</soap:Envelope>
